# Реалізуйте генераторну функцію (з використанням оператора yield), яка повертатиме по одному члену числової послідовності,
# закон якої задається за допомогою функції користувача. Крім цього параметром генераторної функції повинні
# бути значення першого члена прогресії та кількість членів, що видаються послідовності (n).
# Генератор повинен зупинити свою роботу з досягнення n-го члена.
# Підказка: це завдання дуже схоже на нескінченний лічильник з матеріалів лекції! Потрібно лише обмежити кількість видаваних генератором значень!
def some_gen(begin, end, func):
    current = begin
    for _ in range(end + 1):
        yield current
        current = func(current)

def pow(x):
    return x ** 2

from inspect import isgenerator

gen = some_gen(2, 4, pow)
assert isgenerator(gen) == True, 'Test1'
assert list(gen) == [2, 4, 16, 256, 65536], 'Test2'

print('OK')
